print ("Простой todo:\n1.","Добавить задачу.\n2.","Вывести список задач.\n3.","Выход.")
todo = []

while True:
    a= int(input("Укажите число: ",))
    if a==1:
        task=input("Сформулируйте задачу: ",)
        cat=input("Добавьте категорию к задаче: ",)
        time=input("Добавьте время к задаче: ",)
        todo.append('Задача: {0}, Категория: {1}, Дата: {2}'.format(task,cat,time))
        print("Простой todo:\n1.","Добавить задачу.\n2.","Вывести список задач.\n3.","Выход.")
    if a==2:
        for i in todo:
            print(i)
    if a ==3:
        break
